Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནི་ཁམས་གསུམ་ནས་འབྱུང་བ་མེད་དོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་གནས་པ་མེད་དོ།
en: A pratyekabuddha, a bodhisattva, and a tathāgata, arhat, and completely awakened buddha will not depart from the three realms, and will not come to rest in all-aspect omniscience.

source: །རབ་འབྱོར་དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དགྲ་བཅོམ་པའི་ངོ་བོ་ཉིད་ནི་དགྲ་བཅོམ་པའི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་བའི་ཕྱིར་རོ། །རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། དེ་བཞིན་གཤེགས་པའི་ངོ་བོ་ཉིད་ནི། དེ་བཞིན་གཤེགས་པའི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ།
en: If you ask why, Subhūti, it is because the essential nature of an arhat is empty of the essential nature of an arhat, and because the essential nature of a pratyekabuddha, a bodhisattva, and a tathāgata is empty of the essential nature of a tathāgata [and so forth]. {

source: །རབ་འབྱོར་གང་མཚན་ཉིད་མེད་པའི་ཆོས་རྣམས་འབྱུང་བར་འདོད་པ་དེ་ནི། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་འབྱུང་བར་འདོད་དུ་ཟད་དོ། །རབ་འབྱོར་གང་མཚན་ཉིད་མེད་པའི་ཆོས་རྣམས་འབྱུང་བར་འདོད་པ་དེ་ནི། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་།
en: Dt.228} “Subhūti, to expect phenomena without defining characteristics to depart would amount to expecting the fruit of entering the stream to nirvāṇa to depart.

source: ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་འབྱུང་བར་འདོད་དུ་ཟད་དོ།
en: Subhūti, to expect phenomena without defining characteristics to depart would amount to expecting the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, individual enlightenment, knowledge of the path, and all-aspect omniscience to depart.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ནི་ཁམས་གསུམ་ནས་འབྱུང་བ་མེད་དོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་གནས་པ་མེད་དོ། །ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་།
en: If you ask why, Subhūti, the fruit of entering the stream to nirvāṇa will not depart from the three realms, and will not come to rest in all-aspect omniscience.

source: ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ནི་ཁམས་གསུམ་ནས་འབྱུང་བ་མེད་དོ།
en: The fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, individual enlightenment, knowledge of the path, and all-aspect omniscience will not depart from the three realms, and will not come to rest in all-aspect omniscience.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་གནས་པ་མེད་དོ། །རབ་འབྱོར་དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུའི་ངོ་བོ་ཉིད་ནི། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུའི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ། །ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་།
en: If you ask why, Subhūti, it is because the essential nature of the fruit of entering the stream to nirvāṇa is empty of the essential nature of the fruit of entering the stream to nirvāṇa.

source: ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ནི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ།
en: The essential nature of the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, individual enlightenment, knowledge of the path, and all-aspect omniscience is empty of the essential nature of all-aspect omniscience [and so forth]. “

source: །རབ་འབྱོར་གང་མཚན་ཉིད་མེད་པའི་ཆོས་རྣམས་འབྱུང་བར་འདོད་པ་དེ་ནི། མིང་འབྱུང་བར་འདོད་དུ་ཟད་དོ།
en: Subhūti, to expect phenomena without defining characteristics to depart would amount to expecting names to depart.

source: །རབ་འབྱོར་གང་མཚན་ཉིད་མེད་པའི་ཆོས་རྣམས་འབྱུང་བར་འདོད་པ་དེ་ནི། མཚན་མ་འབྱུང་བར་འདོད་དུ་ཟད་དོ།
en: Subhūti, to expect phenomena without defining characteristics to depart would amount to expecting signs to depart.

source: །རབ་འབྱོར་གང་མཚན་ཉིད་མེད་པའི་ཆོས་རྣམས་འབྱུང་བར་འདོད་པ་དེ་ནི། བརྡ་འབྱུང་བར་འདོད་དུ་ཟད་དོ།
en: Subhūti, to expect phenomena without defining characteristics to depart would amount to expecting symbols to depart.

source: །རབ་འབྱོར་གང་མཚན་ཉིད་མེད་པའི་ཆོས་རྣམས་འབྱུང་བར་འདོད་པ་དེ་ནི། ཐ་སྙད་འབྱུང་བར་འདོད་དུ་ཟད་དོ།
en: Subhūti, to expect phenomena without defining characteristics to depart would amount to expecting conventional expressions to depart.

source: །རབ་འབྱོར་གང་མཚན་ཉིད་མེད་པའི་ཆོས་རྣམས་འབྱུང་བར་འདོད་པ་དེ་ནི།
en: Subhūti, to expect phenomena without defining characteristics to depart would amount to expecting designations to depart.

source: གདགས་པ་འབྱུང་བར་འདོད་དུ་ཟད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་མིང་སྟོང་པ་ཉིད་ནི་ཁམས་གསུམ་ནས་འབྱུང་བ་མེད་དོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་གནས་པ་མེད་དོ།
en: If you ask why, Subhūti, the emptiness of names will not depart from the three realms, and will not come to rest in all-aspect omniscience.

source: །མཚན་མ་སྟོང་པ་ཉིད་ནི་ཁམས་གསུམ་ནས་འབྱུང་བ་མེད་དོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་གནས་པ་མེད་དོ།
en: The emptiness of signs will not depart from the three realms, and will not come to rest in all-aspect omniscience.

source: །བརྡ་སྟོང་པ་ཉིད་ནི་ཁམས་གསུམ་ནས་འབྱུང་བ་མེད་དོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་གནས་པ་མེད་དོ།
en: The emptiness of symbols will not depart from the three realms, and will not come to rest in all-aspect omniscience.

source: །ཐ་སྙད་སྟོང་པ་ཉིད་ནི་ཁམས་གསུམ་ནས་འབྱུང་བ་མེད་དོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་གནས་པ་མེད་དོ།
en: The emptiness of conventional expressions will not depart from the three realms, and will not come to rest in all-aspect omniscience.

source: །གདགས་པ་སྟོང་པ་ཉིད་ནི་ཁམས་གསུམ་ནས་འབྱུང་བ་མེད་དོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་གནས་པ་མེད་དོ།
en: The emptiness of designations will not depart from the three realms, and will not come to rest in all-aspect omniscience.

source: །རབ་འབྱོར་དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་མིང་སྟོང་པ་ཉིད་ནི་མིང་སྟོང་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ། །མཚན་མ་སྟོང་པ་ཉིད་མཚན་མ་སྟོང་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ། །བརྡ་སྟོང་པ་ཉིད་བརྡ་སྟོང་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ། །ཐ་སྙད་སྟོང་པ་ཉིད་ཐ་སྙད་སྟོང་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ། །གདགས་པ་སྟོང་པ་ཉིད་གདགས་པ་སྟོང་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ།
en: If you ask why, Subhūti, it is because the emptiness of names is empty of the essential nature of the emptiness of names, the emptiness of signs is empty of the essential nature of the emptiness of signs, the emptiness of symbols is empty of the essential nature of the emptiness of symbols, the emptiness of conventional expressions is empty of the essential nature of the emptiness of conventional expressions, and the emptiness of designations is empty of the essential nature of the emptiness of designations. “

source: །རབ་འབྱོར་གང་མཚན་ཉིད་མེད་པའི་ཆོས་རྣམས་འབྱུང་བར་འདོད་པ་དེ་ནི། སྐྱེ་བ་མེད་པ་འབྱུང་བར་འདོད་དུ་ཟད་དོ།
en: Subhūti, to expect phenomena without defining characteristics to depart would amount to expecting that which is nonarising to depart.

source: །རབ་འབྱོར་གང་མཚན་ཉིད་མེད་པའི་ཆོས་རྣམས་འབྱུང་བར་འདོད་པ་དེ་ནི། འགག་པ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་འབྱུང་བར་འདོད་དུ་ཟད་དོ།
en: Subhūti, to expect phenomena without defining characteristics to depart would amount to expecting that which is unceasing, nonaffliction, nonpurification, and nonconditioning to depart.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་སྐྱེ་བ་མེད་པའི་ངོ་བོ་ཉིད་ནི་ཁམས་གསུམ་ནས་འབྱུང་བ་མེད་དོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་གནས་པ་མེད་དོ།
en: If you ask why, Subhūti, the essential nature of that which is nonarising will not depart from the three realms, and will not come to rest in all-aspect omniscience.

source: །འགག་པ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པའི་ངོ་བོ་ཉིད་ནི་ཁམས་གསུམ་ནས་འབྱུང་བ་མེད་དོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་གནས་པ་མེད་དོ།
en: The essential nature of that which is unceasing, and of nonaffliction, nonpurification, and nonconditioning will not depart from the three realms, and will not come to rest in all-aspect omniscience.

source: །རབ་འབྱོར་དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་སྐྱེ་བ་མེད་པ་ནི་སྐྱེ་བ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ།
en: If you ask why, Subhūti, it is because nonarising is empty of the essential nature of nonarising.

source: །འགག་པ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་ནི། མངོན་པར་འདུ་བྱ་བ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ།
en: Nonceasing, nonaffliction, nonpurification, and nonconditioning are empty of the essential nature of nonconditioning [and so forth].

source: །རབ་འབྱོར་དེ་ལྟར་རྣམ་གྲངས་དེས་ན། འདི་ལྟར་ཐེག་པ་ཆེན་པོ་ནི་ཁམས་གསུམ་ནས་བྱུང་ནས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་གནས་པ་མེད་པར་ཤེས་པར་བྱ་སྟེ། གནས་དེ་ནི་བསྐྱོད་དུ་མེད་པའོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ།
en: Subhūti, those are the formulations explaining how one should know that the Great Vehicle does not depart from the three realms, and consequently does not come to rest in all-aspect omniscience.

source: །བམ་པོ་བཅུ་དགུ་པ།
en: That nonresting is unstirring. “

source: །རབ་འབྱོར་གཞན་ཡང་ཁྱོད་ཀྱིས་གང་འདི་སྐད་དུ། ཐེག་པ་ཆེན་པོ་དེ་གང་དུ་གནས་པར་འགྱུར་ཞེས་སྨྲས་པ་དེ།
en: Subhūti, you also asked where this Great Vehicle will come to rest.

source: ཐེག་པ་ཆེན་པོ་དེ་གང་དུ་ཡང་གནས་པར་འགྱུར་བ་མེད་དེ།
en: This Great Vehicle will not come to rest anywhere. {

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་ཆོས་ཐམས་ཅད་ནི་གནས་མི་དམིགས་པའི་ཕྱིར་མི་གནས་པ་སྟེ།
en: Dt.229} If you ask why, it is because resting is nonapprehensible, and so all phenomena do not come to rest.

source: རབ་འབྱོར་དེ་ལྟར་ཐེག་པ་ཆེན་པོ་དེ་ནི་མི་གནས་པའི་ཚུལ་གྱིས་གནས་སོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ། དཔེར་ན།
en: Subhūti, this Great Vehicle will come to rest by way of its nonresting.

source: ཆོས་ཀྱི་དབྱིངས་ནི་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ། དཔེར་ན།
en: Subhūti, just as the realm of phenomena neither comes to rest, nor does it not come to rest, similarly, Subhūti, this Great Vehicle does not come to rest, nor does it not come to rest.

source: དེ་བཞིན་ཉིད་དང་། ཡང་དག་པའི་མཐའ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་ནི་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན།
en: Subhūti, just as the real nature, the very limit of reality, and the inconceivable realm neither come to rest, nor do they not come to rest, similarly, Subhūti, this Great Vehicle does not come to rest, nor does it not come to rest.

source: མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ངོ་བོ་ཉིད་ལ་གནས་པ་འམ།
en: If you ask why, Subhūti, in the essential nature of the realm of phenomena there is neither resting nor nonresting.

source: མི་གནས་པ་མེད་དོ། །དེ་བཞིན་ཉིད་དང་། ཡང་དག་པའི་མཐའ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་ཀྱི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པ་འམ། མི་གནས་པ་མེད་དོ།
en: In the essential nature of the real nature, the very limit of reality, and the inconceivable realm, there is neither resting nor nonresting.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་ཆོས་ཀྱི་དབྱིངས་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་བའི་ཕྱིར་རོ། །དེ་བཞིན་ཉིད་དེ་བཞིན་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ། །ཡང་དག་པའི་མཐའ་ཡང་དག་པའི་མཐའི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་བའི་ཕྱིར་རོ། །བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་ཀྱི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་བའི་ཕྱིར་རོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ། དཔེར་ན།
en: If you ask why, Subhūti, it is because the realm of phenomena is empty of the essential nature of the realm of phenomena, the real nature is empty of the essential nature of the real nature, the very limit of reality is empty of the essential nature of the very limit of reality, and the inconceivable realm is empty of the essential nature of the inconceivable realm. “

source: ནམ་མཁའི་དབྱིངས་ནི་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ། དཔེར་ན།
en: Subhūti, just as the expanse of space neither comes to rest, nor does it not come to rest, similarly, Subhūti, this Great Vehicle does not come to rest, nor does it not come to rest.

source: འདོད་ཆགས་ཟད་པའི་དབྱིངས་ནི་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན་མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ། དཔེར་ན།
en: Subhūti, just as the disposition of the exhaustion of desire neither comes to rest, nor does it not come to rest, similarly, Subhūti, this Great Vehicle does not come to rest, nor does it not come to rest.

source: རབ་ཏུ་བྱང་བའི་དབྱིངས་དང་། འདོད་ཆགས་དང་བྲལ་བའི་དབྱིངས་དང་། འགོག་པའི་དབྱིངས་ལ་ནི་གནས་པའམ། མི་གནས་པ་མེད་དོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན།
en: Subhūti, just as the disposition of renunciation, the disposition of freedom from desire, and the disposition of cessation neither come to rest, nor do they not come to rest, similarly, Subhūti, this Great Vehicle does not come to rest, nor does it not come to rest.

source: མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ནམ་མཁའི་དབྱིངས་ཀྱི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པའམ། མི་གནས་པ་མེད་དོ།
en: If you ask why, in the essential nature of the expanse of space there is neither resting nor nonresting.

source: །འདོད་ཆགས་ཟད་པའི་དབྱིངས་དང་། རབ་ཏུ་བྱང་བའི་དབྱིངས་དང་། འདོད་ཆགས་དང་བྲལ་བའི་དབྱིངས་དང་། འགོག་པའི་དབྱིངས་ཀྱི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པའམ། མི་གནས་པ་མེད་དོ།
en: In the essential nature of the disposition of exhausted desire, the disposition of renunciation, the disposition of freedom from desire, and the disposition of cessation there is neither resting nor nonresting.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་ནམ་མཁའི་དབྱིངས་ནམ་མཁའི་དབྱིངས་ཀྱི་རང་བཞིན་གྱིས་སྟོང་བའི་ཕྱིར་རོ། །འདོད་ཆགས་ཟད་པའི་དབྱིངས་འདོད་ཆགས་ཟད་པའི་དབྱིངས་ཀྱི་རང་བཞིན་གྱིས་སྟོང་བའི་ཕྱིར་རོ། །རབ་ཏུ་བྱང་བའི་དབྱིངས་རབ་ཏུ་བྱང་བའི་དབྱིངས་ཀྱི་རང་བཞིན་གྱིས་སྟོང་བའི་ཕྱིར་རོ། །འདོད་ཆགས་དང་བྲལ་བའི་དབྱིངས་འདོད་ཆགས་དང་བྲལ་བའི་དབྱིངས་ཀྱི་རང་བཞིན་གྱིས་སྟོང་བའི་ཕྱིར་རོ། །འགོག་པའི་དབྱིངས་འགོག་པའི་དབྱིངས་ཀྱི་རང་བཞིན་གྱིས་སྟོང་བའི་ཕྱིར་རོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ། དཔེར་ན།
en: If you ask why, Subhūti, it is because the expanse of space is empty of the inherent existence of the expanse of space, the disposition of the exhaustion of desire is empty of the inherent existence of the disposition of the exhaustion of desire, the disposition of renunciation is empty of the inherent existence of the disposition of renunciation, the disposition of freedom from desire is empty of the inherent existence of the disposition of freedom from desire, and the disposition of cessation is empty of the inherent existence of the disposition of cessation. “

source: གཟུགས་སྟོང་པ་ཉིད་ནི་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ། དཔེར་ན། ཚོར་བ་སྟོང་པ་ཉིད་དང་།
en: Subhūti, just as the emptiness of physical forms neither comes to rest, nor does it not come to rest, similarly, Subhūti, this Great Vehicle does not come to rest, nor does it not come to rest.

source: འདུ་ཤེས་སྟོང་པ་ཉིད་དང་། འདུ་བྱེད་སྟོང་པ་ཉིད་དང་། རྣམ་པར་ཤེས་པ་སྟོང་པ་ཉིད་ནི་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན།
en: Subhūti, just as the emptiness of feelings, the emptiness of perceptions, the emptiness of formative predispositions, and the emptiness of consciousness neither come to rest, nor do they not come to rest, similarly, Subhūti, this Great Vehicle does not come to rest, nor does it not come to rest.

source: མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་གཟུགས་ཀྱི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པའམ། མི་གནས་པ་མེད་དོ།
en: If you ask why, Subhūti, in the essential nature of physical forms there is neither resting nor nonresting.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པ་འམ། མི་གནས་པ་མེད་དོ།
en: In the essential nature of feelings, perceptions, formative predispositions, and consciousness there is neither resting nor nonresting.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་གཟུགས་གཟུགས་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ། །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་རྣམ་པར་ཤེས་པས་སྟོང་པའི་ཕྱིར་རོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ། དཔེར་ན།
en: If you ask why, Subhūti, it is because physical forms are empty of physical forms, and because feelings, perceptions, formative predispositions, and consciousness are empty of consciousness [and so forth]. “

source: མིག་སྟོང་པ་ཉིད་ནི་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན་མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ། དཔེར་ན། རྣ་བ་སྟོང་པ་ཉིད་དང་། སྣ་སྟོང་པ་ཉིད་དང་།
en: Subhūti, just as the emptiness of the eyes neither comes to rest, nor does it not come to rest, similarly, Subhūti, this Great Vehicle does not come to rest, nor does it not come to rest.

source: ལྕེ་སྟོང་པ་ཉིད་དང་། ལུས་སྟོང་པ་ཉིད་དང་། ཡིད་སྟོང་པ་ཉིད་ནི་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན།
en: Subhūti, just as the emptiness of the ears, the emptiness of the nose, the emptiness of the tongue, the emptiness of the body, and the emptiness of the mental faculty neither come to rest, nor do they not come to rest, similarly, Subhūti, this Great Vehicle does not come to rest, nor does it not come to rest.

source: མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་མིག་གི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པའམ། མི་གནས་པ་མེད་དོ།
en: If you ask why, Subhūti, in the essential nature of the eyes there is neither resting nor nonresting.

source: །རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་ཀྱི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པའམ་མི་གནས་པ་མེད་དོ།
en: In the essential nature of the ears, the nose, the tongue, the body, and the mental faculty there is neither resting nor nonresting.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་མིག་མིག་གིས་སྟོང་པའི་ཕྱིར་རོ། །རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་ནི་ཡིད་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ།
en: If you ask why, Subhūti, it is because the eyes are empty of the eyes, and because the ears, the nose, the tongue, the body, and the mental faculty are empty of the mental faculty [and so forth]. “

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ། དཔེར་ན། གཟུགས་སྟོང་པ་ཉིད་ནི་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན་མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། སྒྲ་སྟོང་པ་ཉིད་དང་།
en: Subhūti, just as the emptiness of sights neither comes to rest, nor does it not come to rest, similarly, Subhūti, this Great Vehicle does not come to rest, nor does it not come to rest.

source: དྲི་སྟོང་པ་ཉིད་དང་། རོ་སྟོང་པ་ཉིད་དང་། རེག་སྟོང་པ་ཉིད་དང་། ཆོས་སྟོང་པ་ཉིད་ནི་གནས་པ་ཡང་མ་ཡིན་མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན་མི་གནས་པ་ཡང་མ་ཡིན་ནོ།
en: Subhūti, just as the emptiness of sounds, the emptiness of odors, the emptiness of tastes, the emptiness of tangibles, and the emptiness of mental phenomena neither come to rest, nor do they not come to rest, similarly, Subhūti, this Great Vehicle does not come to rest, nor does it not come to rest.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་གཟུགས་ཀྱི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པའམ་མི་གནས་པ་མེད་དོ།
en: If you ask why, Subhūti, in the essential nature of sights there is neither resting nor nonresting.

source: །སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་དང་། ཆོས་ཀྱི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པའམ་མི་གནས་པ་མེད་དོ།
en: In the essential nature of sounds, odors, tastes, tangibles, and mental phenomena there is neither resting nor nonresting.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་གཟུགས་གཟུགས་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ། །སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་དང་། ཆོས་ཆོས་ཀྱིས་སྟོང་པའི་ཕྱིར་རོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན།
en: If you ask why, Subhūti, it is because sights are empty of the eyes, and because sounds, odors, tastes, tangibles, and mental phenomena are empty of mental phenomena [and so forth]. “

source: མིག་གི་རྣམ་པར་ཤེས་པ་སྟོང་པ་ཉིད་ནི་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་། སྣའི་རྣམ་པར་ཤེས་པ་དང་།
en: Subhūti, just as the emptiness of visual consciousness neither comes to rest, nor does it not come to rest, similarly, Subhūti, this Great Vehicle does not come to rest, nor does it not come to rest.

source: ལྕེའི་རྣམ་པར་ཤེས་པ་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་སྟོང་པ་ཉིད་ནི་གནས་པ་ཡང་མ་ཡིན། མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན།
en: Subhūti, just as the emptiness of auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, and mental consciousness neither come to rest, nor do they not come to rest, similarly, Subhūti, this Great Vehicle does not come to rest, nor does it not come to rest.

source: མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་མིག་གི་རྣམ་པར་ཤེས་པའི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པའམ་མི་གནས་པ་མེད་དོ།
en: If you ask why, Subhūti, in the essential nature of visual consciousness there is neither resting nor nonresting.

source: །རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་། སྣའི་རྣམ་པར་ཤེས་པ་དང་། ལྕེའི་རྣམ་པར་ཤེས་པ་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པའམ་མི་གནས་པ་མེད་དོ།
en: In the essential nature of auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, and mental consciousness there is neither resting nor nonresting.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་མིག་གི་རྣམ་པར་ཤེས་པ་མིག་གི་རྣམ་པར་ཤེས་པས་སྟོང་པའི་ཕྱིར་རོ། །རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་། སྣའི་རྣམ་པར་ཤེས་པ་དང་། ལྕེའི་རྣམ་པར་ཤེས་པ་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པས་སྟོང་པའི་ཕྱིར་རོ།
en: If you ask why, Subhūti, it is because visual consciousness is empty of visual consciousness, and because auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, and mental consciousness are empty of mental consciousness [and so forth]. “

source: །རབ་འབྱོར་འདི་ལྟ་སྟེ། དཔེར་ན། མིག་གི་འདུས་ཏེ་རེག་པ་སྟོང་པ་ཉིད་ནི་གནས་པ་ཡང་མ་ཡིན་མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན་མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ། དཔེར་ན། རྣ་བའི་འདུས་ཏེ་རེག་པ་སྟོང་པ་ཉིད་དང་།
en: Subhūti, just as the emptiness of visually compounded sensory contact neither comes to rest, nor does it not come to rest, similarly, Subhūti, this Great Vehicle does not come to rest, nor does it not come to rest.

source: སྣའི་འདུས་ཏེ་རེག་པ་སྟོང་པ་ཉིད་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་སྟོང་པ་ཉིད་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་སྟོང་པ་ཉིད་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་སྟོང་པ་ཉིད་ནི་གནས་པ་ཡང་མ་ཡིན་མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །རབ་འབྱོར་དེ་བཞིན་དུ་ཐེག་པ་ཆེན་པོ་དེ་ཡང་གནས་པ་ཡང་མ་ཡིན།
en: Subhūti, just as the emptiness of aurally compounded sensory contact, the emptiness of nasally compounded sensory contact, the emptiness of lingually compounded sensory contact, the emptiness of corporeally compounded sensory contact, and the emptiness of mentally compounded sensory contact neither come to rest, nor do they not come to rest, similarly, Subhūti, this Great Vehicle does not come to rest, nor does it not come to rest.

source: མི་གནས་པ་ཡང་མ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་མིག་གི་འདུས་ཏེ་རེག་པའི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པའམ་མི་གནས་པ་མེད་དོ།
en: If you ask why, Subhūti, in the essential nature of visually compounded sensory contact there is neither resting nor nonresting.

source: །རྣ་བའི་འདུས་ཏེ་རེག་པ་དང་། སྣའི་འདུས་ཏེ་རེག་པ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་ངོ་བོ་ཉིད་ལ་ནི་གནས་པའམ་མི་གནས་པ་མེད་དོ།
en: In the essential nature of aurally compounded sensory contact, nasally compounded sensory contact, lingually compounded sensory contact, corporeally compounded sensory contact, and mentally compounded sensory contact there is neither resting nor nonresting.
